; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph3 - mode
	thermograph0 - mode
	thermograph2 - mode
	image1 - mode
	Star2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	Star12 - direction
	Star14 - direction
	Star16 - direction
	Star17 - direction
	Star18 - direction
	Star22 - direction
	GroundStation13 - direction
	GroundStation11 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star23 - direction
	Star20 - direction
	GroundStation10 - direction
	GroundStation1 - direction
	Star24 - direction
	Star21 - direction
	Star15 - direction
	GroundStation19 - direction
	Star25 - direction
	Phenomenon26 - direction
	Planet27 - direction
	Phenomenon28 - direction
	Phenomenon29 - direction
	Planet30 - direction
	Planet31 - direction
	Planet32 - direction
	Phenomenon33 - direction
	Star34 - direction
	Star35 - direction
	Star36 - direction
	Planet37 - direction
	Phenomenon38 - direction
	Phenomenon39 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 Star22)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet32)
	(supports instrument1 image1)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation13)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star22)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star23)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation8)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star24)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 Star23)
	(supports instrument4 image1)
	(supports instrument4 thermograph3)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star21)
	(calibration_target instrument4 Star24)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation10)
	(calibration_target instrument4 Star20)
	(calibration_target instrument4 Star23)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation19)
	(calibration_target instrument5 Star15)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
)
(:goal (and
	(pointing satellite0 Star36)
	(pointing satellite1 Star12)
	(have_image Star25 image1)
	(have_image Phenomenon26 thermograph3)
	(have_image Planet27 thermograph3)
	(have_image Phenomenon28 image1)
	(have_image Phenomenon29 image1)
	(have_image Planet30 thermograph3)
	(have_image Planet31 thermograph0)
	(have_image Planet32 image1)
	(have_image Phenomenon33 thermograph3)
	(have_image Star34 thermograph2)
	(have_image Star35 image1)
	(have_image Star36 image1)
	(have_image Planet37 thermograph3)
	(have_image Phenomenon38 thermograph2)
	(have_image Phenomenon39 image1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 17
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 17
3. (turn_to satellite1 phenomenon26 groundstation8)
   deleted: (pointing satellite1 groundstation8)
   added: (pointing satellite1 phenomenon26)
   goals met: 0 of 17
4. (turn_to satellite0 planet31 planet32)
   deleted: (pointing satellite0 planet32)
   added: (pointing satellite0 planet31)
   goals met: 0 of 17
5. (turn_to satellite1 star22 phenomenon26)
   deleted: (pointing satellite1 phenomenon26)
   added: (pointing satellite1 star22)
   goals met: 0 of 17
6. (calibrate satellite1 instrument1 star22)
   added: (calibrated instrument1)
   goals met: 0 of 17
7. (turn_to satellite1 phenomenon26 star22)
   deleted: (pointing satellite1 star22)
   added: (pointing satellite1 phenomenon26)
   goals met: 0 of 17
8. (take_image satellite1 phenomenon26 instrument1 thermograph3)
   added: (have_image phenomenon26 thermograph3)
   goals met: 1 of 17
9. (turn_to satellite1 phenomenon28 phenomenon26)
   deleted: (pointing satellite1 phenomenon26)
   added: (pointing satellite1 phenomenon28)
   goals met: 1 of 17
10. (take_image satellite1 phenomenon28 instrument1 image1)
   added: (have_image phenomenon28 image1)
   goals met: 2 of 17
11. (turn_to satellite1 phenomenon29 phenomenon28)
   deleted: (pointing satellite1 phenomenon28)
   added: (pointing satellite1 phenomenon29)
   goals met: 2 of 17
12. (take_image satellite1 phenomenon29 instrument1 image1)
   added: (have_image phenomenon29 image1)
   goals met: 3 of 17
13. (turn_to satellite1 phenomenon33 phenomenon29)
   deleted: (pointing satellite1 phenomenon29)
   added: (pointing satellite1 phenomenon33)
   goals met: 3 of 17
14. (take_image satellite1 phenomenon33 instrument1 thermograph3)
   added: (have_image phenomenon33 thermograph3)
   goals met: 4 of 17
15. (turn_to satellite1 phenomenon38 phenomenon33)
   deleted: (pointing satellite1 phenomenon33)
   added: (pointing satellite1 phenomenon38)
   goals met: 4 of 17
16. (take_image satellite1 phenomenon38 instrument1 thermograph2)
   added: (have_image phenomenon38 thermograph2)
   goals met: 5 of 17
17. (turn_to satellite1 phenomenon39 phenomenon38)
   deleted: (pointing satellite1 phenomenon38)
   added: (pointing satellite1 phenomenon39)
   goals met: 5 of 17
18. (take_image satellite1 phenomenon39 instrument1 image1)
   added: (have_image phenomenon39 image1)
   goals met: 6 of 17
19. (turn_to satellite1 planet27 phenomenon39)
   deleted: (pointing satellite1 phenomenon39)
   added: (pointing satellite1 planet27)
   goals met: 6 of 17
20. (take_image satellite1 planet27 instrument1 thermograph3)
   added: (have_image planet27 thermograph3)
   goals met: 7 of 17
21. (turn_to satellite1 planet30 planet27)
   deleted: (pointing satellite1 planet27)
   added: (pointing satellite1 planet30)
   goals met: 7 of 17
22. (take_image satellite1 planet30 instrument1 thermograph3)
   added: (have_image planet30 thermograph3)
   goals met: 8 of 17
23. (turn_to satellite1 planet32 planet30)
   deleted: (pointing satellite1 planet30)
   added: (pointing satellite1 planet32)
   goals met: 8 of 17
24. (take_image satellite1 planet32 instrument1 image1)
   added: (have_image planet32 image1)
   goals met: 9 of 17
25. (turn_to satellite1 planet37 planet32)
   deleted: (pointing satellite1 planet32)
   added: (pointing satellite1 planet37)
   goals met: 9 of 17
26. (take_image satellite1 planet37 instrument1 thermograph3)
   added: (have_image planet37 thermograph3)
   goals met: 10 of 17
27. (turn_to satellite1 star12 planet37)
   deleted: (pointing satellite1 planet37)
   added: (pointing satellite1 star12)
   goals met: 11 of 17
28. (turn_to satellite1 star25 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star25)
   goals met: 10 of 17
29. (take_image satellite1 star25 instrument1 image1)
   added: (have_image star25 image1)
   goals met: 11 of 17
30. (turn_to satellite1 star12 star25)
   deleted: (pointing satellite1 star25)
   added: (pointing satellite1 star12)
   goals met: 12 of 17
31. (turn_to satellite1 star34 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star34)
   goals met: 11 of 17
32. (take_image satellite1 star34 instrument1 thermograph2)
   added: (have_image star34 thermograph2)
   goals met: 12 of 17
33. (turn_to satellite1 star12 star34)
   deleted: (pointing satellite1 star34)
   added: (pointing satellite1 star12)
   goals met: 13 of 17
34. (turn_to satellite1 star35 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star35)
   goals met: 12 of 17
35. (take_image satellite1 star35 instrument1 image1)
   added: (have_image star35 image1)
   goals met: 13 of 17
36. (turn_to satellite1 star12 star35)
   deleted: (pointing satellite1 star35)
   added: (pointing satellite1 star12)
   goals met: 14 of 17
37. (turn_to satellite1 star36 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star36)
   goals met: 13 of 17
38. (take_image satellite1 star36 instrument1 image1)
   added: (have_image star36 image1)
   goals met: 14 of 17
39. (turn_to satellite1 star12 star36)
   deleted: (pointing satellite1 star36)
   added: (pointing satellite1 star12)
   goals met: 15 of 17
40. (turn_to satellite0 star22 planet31)
   deleted: (pointing satellite0 planet31)
   added: (pointing satellite0 star22)
   goals met: 15 of 17
41. (calibrate satellite0 instrument0 star22)
   added: (calibrated instrument0)
   goals met: 15 of 17
42. (turn_to satellite0 planet31 star22)
   deleted: (pointing satellite0 star22)
   added: (pointing satellite0 planet31)
   goals met: 15 of 17
43. (take_image satellite0 planet31 instrument0 thermograph0)
   added: (have_image planet31 thermograph0)
   goals met: 16 of 17
44. (turn_to satellite0 star36 planet31)
   deleted: (pointing satellite0 planet31)
   added: (pointing satellite0 star36)
   goals met: 17 of 17
